In [1]:
import numpy as np

import pandas as pd

In [2]:
pwd

'J:\\Python\\Scripts\\LSR - 22- Sep'

In [3]:
import os 
os.path

In [4]:
import pandas as pd

In [5]:
['a', 'b']

['a', 'b']

In [6]:
'A B C D'.split()

['A', 'B', 'C', 'D']

In [7]:
np.random.seed(245) # seed means we get the same random number

In [8]:
'a b c d'.split()

['a', 'b', 'c', 'd']

In [9]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [10]:
emp = pd.DataFrame(np.random.randint(0,50,20).reshape(4,5), index = ['emp1','emp2','emp3','emp4'], columns=['age', 'weight', 'height','bmi','etc'])

In [11]:
emp[emp["age"]==17]

Empty DataFrame
Columns: [age, weight, height, bmi, etc]
Index: []

In [12]:
#emp[["age","weight", "bmi"]]
emp.loc[["emp1", "emp2"]]

      age  weight  height  bmi  etc
emp1   43      44      42   37   41
emp2   47      14      17    7   10

In [13]:
emp.loc[["emp1","emp2"],["age","weight"]]

      age  weight
emp1   43      44
emp2   47      14

In [14]:
emp[emp["age"]>28][["height", "weight"]]

      height  weight
emp1      42      44
emp2      17      14
emp4       5       0

In [15]:
emp[emp['age']==28]

      age  weight  height  bmi  etc
emp3   28       3      13    3   32

In [16]:
emp[(emp["age"]>12) | (emp["weight"]>15)][["age", "height"]]

      age  height
emp1   43      42
emp2   47      17
emp3   28      13
emp4   35       5

In [17]:
emp["salary"]= [100,200,300,400]

In [18]:
emp["salary"]*2

emp1    200
emp2    400
emp3    600
emp4    800
Name: salary, dtype: int64

In [19]:
emp.reindex(labels = ["height", "etc", "bmi","weight"], axis = 1)

      height  etc  bmi  weight
emp1      42   41   37      44
emp2      17   10    7      14
emp3      13   32    3       3
emp4       5   43   11       0

In [20]:
emp = emp[emp["bmi"]>3]

In [21]:
emp

      age  weight  height  bmi  etc  salary
emp1   43      44      42   37   41     100
emp2   47      14      17    7   10     200
emp4   35       0       5   11   43     400

In [22]:
emp[['age','weight']]

      age  weight
emp1   43      44
emp2   47      14
emp4   35       0

In [23]:
b = emp[['age','weight']]

In [24]:
type(b)

pandas.core.frame.DataFrame

In [25]:
emp.loc[["emp1"],['age','weight']]

      age  weight
emp1   43      44

In [26]:
emp['age']>45

emp1    False
emp2     True
emp4    False
Name: age, dtype: bool

In [27]:
e = emp[emp['age']>45]

In [28]:
print(e)
type(e)

      age  weight  height  bmi  etc  salary
emp2   47      14      17    7   10     200

pandas.core.frame.DataFrame

In [29]:
emp[(emp['age']>45) & (emp['weight']>12)]

      age  weight  height  bmi  etc  salary
emp2   47      14      17    7   10     200

In [30]:
emp[emp['age']>45 & emp['weight']>12]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
emp

In [ ]:
emp['sex'] = ['Male', 'Female', "tansgender"]
emp

In [ ]:
emp.drop(["sex"], axis =1 )

In [ ]:
emp

In [ ]:
emp.drop(['sex'], axis=1, inplace = True)
emp

In [ ]:
emp['sex'] = ['Male', 'Female']
emp

In [ ]:
emp.drop(['sex'], axis=1)
emp

In [ ]:
w = emp['age'].unique()
type(w)

In [ ]:
w = emp['age'].nunique()
w

In [ ]:
w = emp['age'].value_counts()
w

In [ ]:
emp[(emp['age']>2 )|(emp["weight"]>11)]

In [ ]:
#emp[emp.loc[["emp2"]]>10]

In [ ]:
emp.drop(["age"],axis =1,inplace = True)

In [ ]:
emp

In [ ]:
df = pd.DataFrame(np.random.randint(0,100, 20).reshape(5,4), index = 'A B C D E'.split(),columns='W X Y Z'.split())
df

In [ ]:
df.drop(['A','B'], axis = 0 , inplace = True )

In [ ]:
df

In [ ]:
df.loc[["A","B"],["W","X"]]

In [ ]:
df["k"] = [1,2,3,4,5]
df.drop(["k"],axis= 1, inplace = True)

In [ ]:
#df.drop(["Pritam"], inplace = True)

In [ ]:
 a = df.loc[['D'],['X']],df.loc[['E'],['Z']]

In [ ]:
print(a)

In [ ]:
df

In [ ]:
type(a)

In [ ]:
df["new_col"]= [6,4,4,4,4]

In [ ]:
df["new_col"]

In [ ]:
df

In [ ]:
df.drop("new_col", axis = 1, inplace = True)

In [ ]:
df

In [ ]:
# another way to do it 
df1 = pd.DataFrame(np.random.randn(5,4),index =['A','B','C','D','E'],columns=['W','Y','Y','K'])

In [ ]:
df1.drop('Y',axis = 1)

Selection and Indexing
 the various methods to grab data from a DataFrame

In [ ]:
df['W']

# if you only want one column with all the indexes you can do in this fashion

In [ ]:
# what if you want more than one column at the same time you can do this in this way
df[['W','X']] # notice here i used two brackets that is the only difference for more than one we have to use two brackets

In [ ]:
df.loc[["A",'B']]

In [ ]:
# similar type of example with more than two columns
df[['W','X','Y']] # see here we can index three columns

In [ ]:
df.loc[['A'],['W','X']] # this is how we can index columns as well as labels

In [ ]:
df.loc[['A','B'],["W","Y"]] # order should be rows and then columns

In [ ]:
df['new_column'] = '4 5 6 8 9'.split() # you can add a column in this way

In [ ]:

df

# if you want to drop a the new column you just added we can do this by df.drop let see how
df.drop('N') # now if you only put the column name that you want to drop that will throw an error something like
#labels 'N' does not contain in the axis becuase by default the df.drop has axis 0 which correspond to rows or labels'ABCDE'
#if we want to remove the column we need to put axis =1 with the column name also you need to set inplace argument to True
#for that to see the effect permanently the reason why pandas does this is for you to not lose any information accidently
#let's see all the examples related to this'

In [ ]:
df.drop('E',axis = 0)

In [ ]:
df

In [ ]:
df.drop('E', axis = 0)

In [ ]:
#df.drop('N',axis=1,inplace = True)

In [ ]:
df

In [ ]:
# let's try to remove the index or row 
df.drop('E') # see here it will not throw an error because by default the axes is 0 which corresponds to rows(labels)

In [ ]:
df # since we have not done inplace = True

In [ ]:
# there are two ways of indexing rows one with df.loc which you can do directly by passng the row name 
# another way is df.iloc in which we use index number like 01234 ...
df.loc['A','Y']

In [ ]:
df.loc[['A','B'],['X','Y']] # notice the difference of brackets here

In [ ]:
df.iloc[[1,2],[0,1]]

In [ ]:
df.iloc[3]

In [ ]:
df = df.reindex(columns=['W','Y','Z','X'], copy = True)

In [ ]:
df

In [ ]:
df1 = pd.DataFrame(np.random.randn(4,3), index = 'j k l m'.split(), columns= [1,2,3])

In [ ]:
df1

In [ ]:
df1.iloc[[1,3],[2]]

# If you want to Add a new row to existing dataframe

In [ ]:
# if you want to add a new row to the existing dataframe you can do it witth df.loc["h"]

# let us see the example
df23 = pd.DataFrame(np.random.randn(4,3),index = 'a b c d'.split(), columns = 'w x y'.split())

In [ ]:
df23

In [ ]:
df23.loc['f'] = '4 5 6'.split()

In [ ]:
df23

In [ ]:
df23.drop('f')

In [ ]:
df23

In [ ]:
# inplace = true
df23.drop('f',axis = 0, inplace = True)

In [ ]:
df23

# if you want to interchange the row (indexes)

In [ ]:
# this is how reindex or interchange indexes ()

df23.reindex(index=['d','b','a','c'], copy = False)

In [ ]:
df23

In [ ]:
df23.reset_index(index = [2,3,4,6,7])

In [ ]:
# Copy here is inplace

# Another way of creating dataframe

In [ ]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df12 = {
'http_status': [200,200,404,404,301],
'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]}

In [ ]:
df12

In [ ]:
pd.DataFrame(df12,index)

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(101)

In [ ]:
df9 = pd.DataFrame(randn(2,3),index = 'K L'.split(),columns='1 2 3'.split())

In [ ]:
df9

In [ ]:
df9['1'] # even if the column names are integers you have to put them in inverted commas while indexing.

In [ ]:
df9[['1','2']]

In [ ]:
df9.loc[['K',"L"]]

In [ ]:
df9.index.name = "Alpha"

In [ ]:
df9

In [31]:
df1 = pd.DataFrame(np.random.randn(4,3), index = 'j k l m'.split(), columns= [1,2,3])

In [32]:
df1

          1         2         3
j  0.706258  0.142314  0.071525
k -0.546767  1.431051 -2.142854
l -0.461015  0.235601 -0.004226
m  1.034047 -1.155211 -0.831938

In [33]:
df1.iloc[:3, 2]

j    0.071525
k   -2.142854
l   -0.004226
Name: 3, dtype: float64

In [34]:
df[df.loc[["A"]]>80].loc[["A"],["Y","Z"]]

NameError: name 'df' is not defined

In [35]:
df[(df["W"]>50) & (df['Y']>60)]

NameError: name 'df' is not defined

In [36]:
df[df["W"]>60]

NameError: name 'df' is not defined

In [37]:
df["W"].unique()

NameError: name 'df' is not defined

In [38]:
emp.columns

Index(['age', 'weight', 'height', 'bmi', 'etc', 'salary'], dtype='object')

In [39]:
emp.iloc[:,3]

emp1    37
emp2     7
emp4    11
Name: bmi, dtype: int32

In [40]:
emp

      age  weight  height  bmi  etc  salary
emp1   43      44      42   37   41     100
emp2   47      14      17    7   10     200
emp4   35       0       5   11   43     400

In [46]:
emp.reindex(["weight", "height","etc"], axis = 1)

      weight  height  etc
emp1      44      42   41
emp2      14      17   10
emp4       0       5   43